# Задача №2. Секция статьи "Задача №2."
# Написать метод int32_to_ip, который принимает на вход 32-битное целое число (integer)
# и возвращает строковое представление его в виде IPv4-адреса:

# 2149583361 -> "128.32.10.1"
# 32         -> "0.0.0.32"
# 0          -> "0.0.0.0"


def int32_to_ip(int32):
    ip = [0, 0, 0, 0]
    for i in range(4):
        ip[i] = (int32 // pow(256, 3 - i)) % 256
    return f"{ip[0]}.{ip[1]}.{ip[2]}.{ip[3]}"


print(int32_to_ip(2154959208))
assert int32_to_ip(2154959208) == "128.114.17.104"
assert int32_to_ip(0) == "0.0.0.0"
assert int32_to_ip(2149583361) == "128.32.10.1"
